Revit 2026 API

# BuiltInFailuresSystemNavigatorFailures Class

---

Failures related with the system browser.

SystemObject Autodesk.Revit.DBBuiltInFailuresSystemNavigatorFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class SystemNavigatorFailures
```
```vb
Public NotInheritable Class SystemNavigatorFailures
```
```cpp
public ref class SystemNavigatorFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type SystemNavigatorFailures = class end
```

The BuiltInFailuresSystemNavigatorFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CannottFindCorrectTreeNode | Can't find the correct tree node in system browser according to the node index. |
|  | MultipleSelectNumberIsWrong | The selected tree nodes number of system browser is wrong. |

#### Reference

Autodesk.Revit.DB Namespace